**Terraform Format and Style🖌** `success`
**Terraform Initialization ⚙️** `success`
**Terraform Plan 📖** `success`
**Terraform Validation 🤖** `success`

<details><summary>Show Plan</summary>

```
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.dmarc[0]: Refreshing state... [id=26880818]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.srv_jmap: Refreshing state... [id=26880820]
dnsimple_zone_record.wtmn_email_redirect: Refreshing state... [id=26984574]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.dkim[2]: Refreshing state... [id=26161933]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.mx_20[0]: Refreshing state... [id=26161960]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.mail: Refreshing state... [id=26161951]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.srv_jmap: Refreshing state... [id=26161947]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.srv_carddavs: Refreshing state... [id=26880813]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.mail: Refreshing state... [id=26880812]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.srv_imaps: Refreshing state... [id=26880816]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.mx_10[0]: Refreshing state... [id=26161966]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.dkim[0]: Refreshing state... [id=26161931]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.dkim[1]: Refreshing state... [id=26161932]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.srv_caldavs: Refreshing state... [id=26161939]
module.dnsimple_fastmail_maildrip_net.dnsimple_zone_record.dmarc[0]: Refreshing state... [id=26932512]
module.dnsimple_fastmail_maildrip_net.dnsimple_zone_record.srv_pop3s: Refreshing state... [id=26932500]
module.dnsimple_fastmail_maildrip_net.dnsimple_zone_record.srv_caldavs: Refreshing state... [id=26932505]
module.dnsimple_fastmail_maildrip_net.dnsimple_zone_record.dkim[1]: Refreshing state... [id=26932510]
module.dnsimple_fastmail_maildrip_net.dnsimple_zone_record.srv_carddavs: Refreshing state... [id=26932502]
module.dnsimple_fastmail_maildrip_net.dnsimple_zone_record.dkim[2]: Refreshing state... [id=26932508]
module.dnsimple_fastmail_maildrip_net.dnsimple_zone_record.dkim[0]: Refreshing state... [id=26932509]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.srv_imaps: Refreshing state... [id=26161934]
module.dnsimple_fastmail_maildrip_net.dnsimple_zone_record.srv_imaps: Refreshing state... [id=26932503]
module.dnsimple_short_io.dnsimple_zone_record.a_record_2: Refreshing state... [id=26982611]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.srv_carddavs: Refreshing state... [id=26161972]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.srv_pop3s: Refreshing state... [id=26161949]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.spf: Refreshing state... [id=26161968]
module.dnsimple_fastmail_maildrip_net.dnsimple_zone_record.srv_submission: Refreshing state... [id=26932501]
module.dnsimple_fastmail_maildrip_net.dnsimple_zone_record.srv_jmap: Refreshing state... [id=26932507]
module.dnsimple_fastmail_maildrip_net.dnsimple_zone_record.mx_20[0]: Refreshing state... [id=26932506]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.mx_20[0]: Refreshing state... [id=26880817]
module.dnsimple_github_pages.dnsimple_zone_record.cname-record-www: Refreshing state... [id=26161971]
module.dnsimple_github_pages.dnsimple_zone_record.alias-record-root: Refreshing state... [id=26161929]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.srv_submission: Refreshing state... [id=26880815]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.mx_20[0]: Refreshing state... [id=26161967]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.srv_pop3s: Refreshing state... [id=26880821]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.mx_10[0]: Refreshing state... [id=26161940]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.dkim[2]: Refreshing state... [id=26161955]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.srv_caldavs: Refreshing state... [id=26161946]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.dkim[0]: Refreshing state... [id=26161953]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.dkim[1]: Refreshing state... [id=26161954]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.srv_pop3s: Refreshing state... [id=26161962]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.spf: Refreshing state... [id=26161961]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.srv_submission: Refreshing state... [id=26161936]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.mail: Refreshing state... [id=26161935]
module.dnsimple_fastmail_maildrip_net.dnsimple_zone_record.mail: Refreshing state... [id=26932498]
dnsimple_zone_record.culturedcode_blog_redirect: Refreshing state... [id=27039987]
dnsimple_zone_record.synology_nas: Refreshing state... [id=26811272]
dnsimple_zone_record.pm_bounces_witteman_me: Refreshing state... [id=27015888]
module.dnsimple_fastmail_maildrip_net.dnsimple_zone_record.spf: Refreshing state... [id=26932511]
dnsimple_zone_record.postmark_domainkey_witteman_me: Refreshing state... [id=27015887]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.srv_carddavs: Refreshing state... [id=26161943]
dnsimple_zone_record.synology_help_redirect: Refreshing state... [id=27039989]
module.dnsimple_fastmail_maildrip_net.dnsimple_zone_record.mx_10[0]: Refreshing state... [id=26932504]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.mx_10[0]: Refreshing state... [id=26880822]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.srv_caldavs: Refreshing state... [id=26880814]
dnsimple_zone_record.home_wtmn_net: Refreshing state... [id=26881012]
dnsimple_zone_record.culturedcode_help_redirect: Refreshing state... [id=27039988]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.spf: Refreshing state... [id=26880826]
dnsimple_zone_record.google_postmaster_verification: Refreshing state... [id=26331373]
dnsimple_zone_record.github_redirect: Refreshing state... [id=26395267]
dnsimple_zone_record.files_wtmn_net_alias: Refreshing state... [id=27004600]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.srv_jmap: Refreshing state... [id=26161937]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.srv_submission: Refreshing state... [id=26161944]
dnsimple_zone_record.witteman_email_redirect: Refreshing state... [id=26984573]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.dmarc[0]: Refreshing state... [id=26161945]
module.dnsimple_short_io.dnsimple_zone_record.a_record_1: Refreshing state... [id=26982612]
dnsimple_zone_record.google_postmaster_verification_georgewitteman_com: Refreshing state... [id=26331623]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.dkim[0]: Refreshing state... [id=26880823]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.dkim[1]: Refreshing state... [id=26880824]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.dkim[2]: Refreshing state... [id=26880825]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.srv_imaps: Refreshing state... [id=26161958]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.dmarc[0]: Refreshing state... [id=26161942]
aws_dynamodb_table.terraform_locks: Refreshing state... [id=terraform-locks]
aws_s3_bucket.terraform_state: Refreshing state... [id=georgewitteman-terraform-state]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_dynamodb_table.terraform_locks will be updated in-place
  ~ resource "aws_dynamodb_table" "terraform_locks" {
        id             = "terraform-locks"
        name           = "terraform-locks"
        tags           = {}
        # (7 unchanged attributes hidden)


      ~ point_in_time_recovery {
          ~ enabled = false -> true
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # aws_kms_key.dynamo_db_kms will be created
  + resource "aws_kms_key" "dynamo_db_kms" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = (known after apply)
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags_all                           = (known after apply)
    }

  # aws_s3_bucket.log_bucket will be created
  + resource "aws_s3_bucket" "log_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "log-delivery-write"
      + arn                         = (known after apply)
      + bucket                      = "georgewitteman-terraform-logs"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # aws_s3_bucket.terraform_state will be updated in-place
  ~ resource "aws_s3_bucket" "terraform_state" {
        id                          = "georgewitteman-terraform-state"
        tags                        = {}
        # (10 unchanged attributes hidden)

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = "log/"
        }


        # (2 unchanged blocks hidden)
    }

  # aws_s3_bucket_public_access_block.example will be created
  + resource "aws_s3_bucket_public_access_block" "example" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = "georgewitteman-terraform-state"
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

Plan: 3 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @georgewitteman, Action: `pull_request`*